const courseEndpoints = [
  {
    id: 'bigDataConcept',
    text: '大數據觀念',
    top: 203,
    left: 8,
    color: ' #9CD07D',
    tooltip:
      '大數據（Big Data）又被稱為巨量資料，其概念其實就是資料分析、商業智慧（Business Intelligence）和統計應用之大成。因為資料量急速成長、儲存設備成本下降、軟體技術進化和雲端環境成熟等種種客觀條件就位，方才讓資料分析從過去的洞悉歷史進化到預測未來，開創從所未見的商業模式。',
  },
  {
    id: 'programLanguage',
    text: '程式語言',
    top: 327,
    left: 8,
    color: ' #C0A2B8',
    tooltip:
      '透過程式語言的運用，可以讓大數據分析得更加精確，常用於大數據分析的程式語言包括Python, R, 以及SQL。',
  },
  {
    id: 'cloudComputing',
    text: '雲端運算',
    top: 119,
    left: 1330,
    color: ' #6f7e98',
    tooltip:
      '雲端運算為透過雲端業者所提供的伺服器來做運算的過程，能夠存取共享式運算資源池，運算資源的提供只需要最少的管理作業與供應商涉入，就能快速配置與發布運算資源。',
  },
  {
    id: 'NLP',
    text: '自然語言處理',
    top: 193,
    left: 1330,
    color: ' #6f7e98',
    tooltip:
      '讓電腦擁有理解人類語言的能力，就是自然語言處理 (Natural Language Processing，縮寫 NLP)。以中文來說，最基本的，要先教電腦學會「斷詞」和「理解詞的意思」',
  },
  {
    id: 'textMining',
    text: '文字探勘',
    top: 258,
    left: 1330,
    color: ' #6f7e98',
    tooltip:
      '文字探勘指的是從非結構化的文字中，透過各種文本分析技術達到探索文字資料中感興趣資訊及挖掘有用知識，萃取出有用的重要資訊。',
  },
  {
    id: 'imageAnalysis',
    text: '影像分析',
    top: 327,
    left: 1330,
    color: ' #6f7e98',
    tooltip:
      '影像分析一般利用數學模型並結合影像處理的技術來分析特徵和結構，從而提取具有一定智慧型性的資訊，對圖像內容進行分析、解釋、和辨識。',
  },
  {
    id: 'speechRecognition',
    text: '語音辨識',
    top: 402,
    left: 1330,
    color: ' #6f7e98',
    tooltip:
      '語音辨識為以電腦自動將人類的語音內容轉換為相應的文字，語音辨識技術的應用包括語音撥號、語音導航、室內裝置控制等。',
  },
  {
    id: 'socialNetworkAnalysis',
    text: '社群網路分析',
    top: 486,
    left: 1330,
    color: ' #6f7e98',
    tooltip:
      '社群網路分析是用來檢視節點、連結之間的社會關係的分析方式。節點是網路中的個人參與者，連結則是參與者之間的關係。節點之間可以有很多種連結。一些學術研究已經顯示，社會網路在很多層面運作，從家庭到國家層面都有，並扮演著關鍵作用，決定問題如何得到解決，組織如何運行，並在某種程度上決定個人能否成功實現目標。用最簡單的形式來說，社會網路是一張地圖，標示出所有與節點相關的連結。社會網路也可以用來衡量個人參與者的社會資本。這些概念往往顯示在一張社會網路圖，其中節點是點狀，連結是線狀。',
  },
];

export default courseEndpoints;
